In [1]:
import sqlite3
import pandas as pd

In [2]:
print(sqlite3.sqlite_version)
print(sqlite3.version)

3.41.2
2.6.0

In [3]:
dpath = 'maindb.db'
conn = sqlite3.connect(dpath)

In [4]:
cur = conn.cursor()

In [8]:
cur.execute("CREATE TABLE employees(id INTEGER PRIMARY KEY, name TEXT NOT NULL, salary REAL, department TEXT, position TEXT, hireDate TEXT)")
conn.commit()

OperationalError: table employees already exists

In [9]:
script = """
DROP TABLE IF EXISTS employees;

CREATE TABLE employees(
id INTEGER PRIMARY KEY AUTOINCREMENT,
name TEXT NOT NULL, 
salary REAL,
department TEXT,
position TEXT,
hireDate TEXT);

INSERT INTO employees(name, salary, department, position, hireDate) VALUES('Dave', 300, 'Marketing', 'LV1', '2020-01-01');
INSERT INTO employees(name, salary, department, position, hireDate) VALUES('Clara', 420, 'Sales', 'LV2', '2018-01-11');
INSERT INTO employees(id, name, salary, department, position, hireDate) VALUES(3, 'Jane', 620, 'Developer', 'LV4', '2015-11-01');
INSERT INTO employees VALUES(4, 'Peter', 530, 'Developer', 'LV2', '2020-11-01'); 
"""

cur.executescript(script)
conn.commit() # DB에 위 Table & Data가 저장

In [10]:
data = [('Elena', 510, 'Recruiter', 'LV3', '2020-07-01'), 
        ('Sujan', 710, 'HR', 'LV5', '2014-06-01'),
        ('Jake', 210, 'CEO', 'LV8', '2012-01-01')]

cur.executemany("INSERT INTO employees(name, salary, department, position, hireDate) VALUES(?, ?, ?, ?, ?)", data)
conn.commit()

In [11]:
cur.execute("SELECT * FROM employees;")

employee_list = cur.fetchall()

for employee in employee_list:
    print(employee)

(1, 'Dave', 300.0, 'Marketing', 'LV1', '2020-01-01')
(2, 'Clara', 420.0, 'Sales', 'LV2', '2018-01-11')
(3, 'Jane', 620.0, 'Developer', 'LV4', '2015-11-01')
(4, 'Peter', 530.0, 'Developer', 'LV2', '2020-11-01')
(5, 'Elena', 510.0, 'Recruiter', 'LV3', '2020-07-01')
(6, 'Sujan', 710.0, 'HR', 'LV5', '2014-06-01')
(7, 'Jake', 210.0, 'CEO', 'LV8', '2012-01-01')

In [12]:
print([col[0] for col in cur.description])

['id', 'name', 'salary', 'department', 'position', 'hireDate']

In [13]:
df = pd.read_sql_query("SELECT * FROM employees", conn) 
df

   id   name  salary department position    hireDate
0   1   Dave   300.0  Marketing      LV1  2020-01-01
1   2  Clara   420.0      Sales      LV2  2018-01-11
2   3   Jane   620.0  Developer      LV4  2015-11-01
3   4  Peter   530.0  Developer      LV2  2020-11-01
4   5  Elena   510.0  Recruiter      LV3  2020-07-01
5   6  Sujan   710.0         HR      LV5  2014-06-01
6   7   Jake   210.0        CEO      LV8  2012-01-01

In [14]:
conn.close()